Bad direction vector in dimension element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LinearConstraintBadDirection { get; }
  Visual Basic
Public Shared ReadOnly Property LinearConstraintBadDirection As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LinearConstraintBadDirection {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace